const TelegramBot = require('node-telegram-bot-api');
const bot = new TelegramBot('8458034643:AAH1KVd6D_FeBOidKtm20HyC4OLFoEPxX4A', { polling: true });

bot.onText(/\/start/, (msg) => {
  bot.sendMessage(msg.chat.id, `
    Добро пожаловать в @MineDrop —
✨ популярную мини-игру в Telegram, в которую уже играют тысячи пользователей!

Здесь тебя ждёт:
🎁 Ежедневные награды и бонусы
🔥 Регулярные промокоды и подарки
🚀 Быстрый и увлекательный геймплей
💸 Возможность моментальных выплат
🎯 Ивенты, задания и приятные призы

Полезные каналы для игроков:
🔥 Промокоды — @minedrop95
🍀 Резервный канал — @minedropreserve
`
    );
});